<?php

$config = [
  'site' => [
    'parent' => '../../',
    'path' => 'http://'.$_SERVER['HTTP_HOST'].str_replace('index.php','',$_SERVER['PHP_SELF']),
    'url' => 'https://jipinwen.unlink.men/',
    'name'  => '祭品文產生器',
    'title' => '祭品文產生器',
    'description' => '只要割闌尾投票率過半，朕就吃垮義美',
    'copyright' => 'just for fun',
    'shortcut-icon' => 'http://jipinwen.unlink.men/images/favicon.png'
  ],
  'setting' => [
    'enable-database' => false
  ],
  'database' => [
    'host'  => '',
    'user'  => '',
    'pass'  => '',
    'db'  => ''
  ],
  'google' => [
    'analytics-id'  => 'UA-00000000-00'
  ],
  'facebook' => [
    'fanpage' => '',
    'app-id' => '',
    'app-secret' => '',
    'privacy-policy' => ''
  ],
  'og' => [
    'title' => '祭品文產生器',
    'type'  => 'website',
    'url' => 'http://jipinwen.unlink.men/',
    'image' => 'http://jipinwen.unlink.men/images/fb.png',
    'sitename'  => '祭品文產生器',
    'description' => '只要割闌尾投票率過半，朕就吃垮義美'
  ],
  'app' => [
    'width' => 800,
    'height' => 420,
    'fontsize' => 41,
    'filename' => '祭品文.png',
    'avoid' => [
      '███' => ['蔡正元','祭止兀','艸一一','菜症猿'],
      '██' => ['止兀','症猿']
    ],
    'avoidlist' => [
      '蔡正元','祭止兀','艸一一','菜症猿','止兀','症猿'
    ],
    'replace' => [
      '███' => ['蔡正元','祭止兀','艸一一','菜症猿'],
      '██' => ['止兀','症猿'],
      '가雞排' => ['@雞排','＠雞排'],
      '雞排가' => ['雞排@','雞排＠'],
      '각珍奶' => ['@珍奶','＠珍奶'],
      '珍奶각' => ['珍奶@','珍奶＠'],
      '각' => ['{飲料}'],
      '갂麥當勞' => ['@麥當勞','＠麥當勞'],
      '麥當勞갂' => ['麥當勞@','麥當勞＠'],
      '간甜甜圈' => ['@甜甜圈','＠甜甜圈'],
      '甜甜圈간' => ['甜甜圈@','甜甜圈＠'],
      '갅牛排' => ['@牛排','＠牛排'],
      '牛排갅' => ['牛排@','牛排＠'],
      '갆冰棒' => ['@冰棒','＠冰棒'],
      '冰棒갆' => ['冰棒@','冰棒＠'],
      '갆' => ['{冰}'],
      '갆曠世奇派' => ['@曠世奇派','＠曠世奇派'],
      '曠世奇派갆' => ['曠世奇派@','曠世奇派＠'],
      '갇隨身碟' => ['@隨身碟','＠隨身碟'],
      '隨身碟갇' => ['隨身碟@','隨身碟＠'],
      '갈切' => ['@切','＠切'],
      '切갈' => ['切@','切＠'],
      '갉樹' => ['@樹','＠樹'],
      '樹갉' => ['樹@','樹＠'],
      '갉' => ['{樹}'],
      '갊籃球架' => ['@籃球架','＠籃球架'],
      '籃球架갊' => ['籃球架@','籃球架＠'],
      '갋告白' => ['@告白','＠告白'],
      '告白갋' => ['告白@','告白＠'],
      '갌裸奔' => ['@裸奔','＠裸奔'],
      '裸奔갌' => ['裸奔@','裸奔＠'],
      '갍肯德基' => ['@肯德基','＠肯德基'],
      '肯德基갍' => ['肯德基@','肯德基＠'],
      '갍KFC' => ['@KFC','＠KFC'],
      'KFC갍' => ['KFC@','KFC＠'],
      '갎摩斯漢堡' => ['@摩斯漢堡','＠摩斯漢堡'],
      '摩斯漢堡갎' => ['摩斯漢堡@','摩斯漢堡＠'],
      '갎MOS漢堡' => ['@MOS漢堡','MOS漢堡'],
      'MOS漢堡갎' => ['MOS漢堡@','MOS漢堡＠'],
      '갏星巴克' => ['@星巴克','＠星巴克'],
      '星巴克갏' => ['星巴克@','星巴克＠'],
      '감義美' => ['@義美','＠義美'],
      '義美감' => ['義美@','義美＠'],
      '갑跳海' => ['@跳海','＠跳海'],
      '跳海갑' => ['跳海@','跳海＠'],
      '값披薩' => ['@披薩','＠披薩'],
      '披薩값' => ['披薩@','披薩＠'],
      '갓消波塊' => ['@消波塊','＠消波塊'],
      '消波塊갓' => ['消波塊@','消波塊＠'],
      '갓' => ['{消波塊}'],
      '갔恰恰' => ['@恰恰','＠恰恰'],
      '恰恰갔' => ['恰恰@','恰恰＠'],
      '갔香瓜子' => ['@香瓜子','＠香瓜子'],
      '香瓜子갔' => ['香瓜子@','香瓜子＠'],
      '갔' => ['{瓜}'],
      '강馬桶' => ['@馬桶','＠馬桶'],
      '馬桶강' => ['馬桶@','馬桶＠'],
      '강' => ['{馬桶}']
    ]
  ],
  'showroom' => [
    'perpage' => 12
  ]
];
